Autodesk.Revit.DB.ExtensibleStorage.AccessLevel
Defines access levels to objects in the Extensible Storage framework.
Since:
2012
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.AccessLevel.Application
Only application that created the object has access to it.

Autodesk.Revit.DB.ExtensibleStorage.AccessLevel.Vendor
Only object vendor has access to it.

Autodesk.Revit.DB.ExtensibleStorage.AccessLevel.Public
Anybody has access to the object.